Repository: yuyakan/MathSurface
Catalog: MathSurface/Localizable.xcstrings
Source language: ja
Languages: ar, de, en, es, fr, hi, id, it, ko, pt_br, pt_pt, ru, tr, zh_hans, zh_hant

source: 規則的な凹凸が並ぶ。最適化アルゴリズムのベンチマーク関数。
ar: مصفوفة منتظمة من النتوءات والانخفاضات. دالة معيارية لخوارزميات الأمثلة.
de: Regelmäßige Hügel- und Talstruktur. Benchmark für Optimierungsalgorithmen.
en: Regular array of bumps and dips. A benchmark for optimization algorithms.
es: Patrón regular de crestas y valles. Función de referencia para algoritmos de optimización.
fr: Réseau régulier de bosses et de creux. Fonction de référence pour les algorithmes d’optimisation.
hi: उभारों व गड्ढों की नियमित शृंखला। अनुकूलन एल्गोरिद्म का बेंचमार्क फलन।
id: Susunan tonjolan dan cekungan teratur. Fungsi tolok ukur untuk algoritma optimasi.
it: Schiera regolare di gobbe e avvallamenti. Funzione di benchmark per algoritmi di ottimizzazione.
ko: 규칙적인 요철이 나열됨. 최적화 알고리즘의 벤치마크 함수.
pt_br: Padrão regular de elevações e depressões. Função de referência para algoritmos de otimização.
pt_pt: Rede regular de saliências e depressões. Função de referência para algoritmos de otimização.
ru: Регулярный массив бугров и впадин. Эталонная функция для алгоритмов оптимизации.
tr: Düzenli tümsek ve çukur dizisi. Optimizasyon algoritmaları için kıyaslama fonksiyonu.
zh_hans: 规则排列的凹凸。优化算法的基准函数。
zh_hant: 規則排列的凹凸。最佳化演算法的基準函數。

source: 設定
ar: الإعدادات
de: Einstellungen
en: Settings
es: Ajustes
fr: Réglages
hi: सेटिंग्स
id: Pengaturan
it: Impostazioni
ko: 설정
pt_br: Ajustes
pt_pt: Definições
ru: Настройки
tr: Ayarlar
zh_hans: 设置

source: 軌跡
ar: المحل الهندسي
de: Ortskurve
en: Locus
es: Lugar geométrico
fr: Lieu géométrique
hi: बिंदुपथ
id: Tempat kedudukan
it: Luogo geometrico
ko: 자취
pt_br: Lugar geométrico
pt_pt: Lugar geométrico
ru: Геометрическое место
tr: Geometrik yer
zh_hans: 轨迹

source: 軌跡プリセット
ar: إعدادات المحل الهندسي المسبقة
de: Ortskurven-Voreinstellungen
en: Locus Presets
es: Lugares predefinidos
fr: Préréglages de lieu
hi: बिंदुपथ प्रीसेट
id: Prasetel tempat kedudukan
it: Preset di luogo geometrico
ko: 자취 프리셋
pt_br: Predefinições de lugares
pt_pt: Predefinições de lugar geométrico
ru: Пресеты мест точек
tr: Geometrik yer ön ayarları
zh_hans: 轨迹预设
zh_hant: 軌跡預設

source: 軸
ar: المحور
de: Achse
en: Axis
es: Eje
fr: Axe
hi: अक्ष
id: Sumbu
it: Asse
ko: 축
pt_br: Eixo
pt_pt: Eixo
ru: Ось
tr: Eksen
zh_hans: 轴

source: 閉じる
ar: إغلاق
de: Schließen
en: Close
es: Cerrar
fr: Fermer
hi: बंद करें
id: Tutup
it: Chiudi
ko: 닫기
pt_br: Fechar
pt_pt: Fechar
ru: Закрыть
tr: Kapat
zh_hans: 关闭
zh_hant: 關閉

source: 関数の ) が見つかりません
ar: قوس الإغلاق ) للدالة مفقود
de: Schließende Klammer der Funktion fehlt
en: Missing closing ) of function
es: Falta el ) de cierre de la función
fr: Parenthèse fermante ) de la fonction manquante
hi: फलन का समापन ) नहीं मिला
id: Kurung tutup ) fungsi tidak ada
it: Manca la ) di chiusura della funzione
ko: 함수의 )를 찾을 수 없습니다
pt_br: Falta o ) de fechamento da função
pt_pt: Falta o parêntese ) de fecho da função
ru: Отсутствует закрывающая ) функции
tr: Fonksiyonun kapanış ) eksik
zh_hans: 未找到函数的 )
zh_hant: 找不到函數的右括號 )

source: 関数の引数の数が違います
ar: عدد الوسائط غير صحيح
de: Falsche Anzahl an Funktionsargumenten
en: Wrong number of arguments
es: Número de argumentos incorrecto
fr: Nombre d’arguments incorrect
hi: तर्कों की संख्या गलत है
id: Jumlah argumen salah
it: Numero di argomenti errato
ko: 함수 인자 수가 잘못되었습니다
pt_br: Número de argumentos incorreto
pt_pt: Número de argumentos incorreto
ru: Неверное число аргументов
tr: Argüman sayısı yanlış
zh_hans: 函数参数数量不正确
zh_hant: 函數的引數數目不正確

source: 鞍のような形。x方向には凹、y方向には凸となる鞍点を持つ。
ar: سطح على شكل سرج: مقعّر في اتجاه x ومحدّب في اتجاه y.
de: Sattelförmige Fläche – konkav in x-Richtung, konvex in y-Richtung.
en: Saddle-shaped surface: concave in x, convex in y.
es: Superficie con forma de silla: cóncava en x, convexa en y.
fr: Surface en forme de selle : concave en x, convexe en y.
hi: सैडल-आकार सतह: x दिशा में अवतल, y दिशा में उत्तल।
id: Permukaan berbentuk pelana: cekung di x, cembung di y.
it: Superficie a forma di sella: concava in x, convessa in y.
ko: 안장 모양 곡면. x 방향으로 오목, y 방향으로 볼록한 안장점.
pt_br: Superfície em forma de sela: côncava em x, convexa em y.
pt_pt: Superfície em forma de sela: côncava em x, convexa em y.
ru: Седлообразная поверхность: вогнутая по x, выпуклая по y.
tr: Eyer biçimli yüzey: x yönünde içbükey, y yönünde dışbükey.
zh_hans: 鞍形曲面：在 x 方向凹，在 y 方向凸的鞍点。
zh_hant: 鞍狀曲面：在 x 方向為凹、y 方向為凸的鞍點。

source: 鞍点（双曲放物面）
ar: سرج (مجسم مكافئ زائدي)
de: Sattelpunkt (hyperbolisches Paraboloid)
en: Saddle (Hyperbolic Paraboloid)
es: Punto de silla (paraboloide hiperbólico)
fr: Selle (paraboloïde hyperbolique)
hi: सैडल (अतिपरवलयिक परवलयज)
id: Pelana (paraboloida hiperbolik)
it: Sella (paraboloide iperbolico)
ko: 안장점(쌍곡 포물면)
pt_br: Ponto de sela (paraboloide hiperbólico)
pt_pt: Sela (paraboloide hiperbólico)
ru: Седло (гиперболический параболоид)
tr: Eyer (hiperbolik paraboloit)
zh_hans: 鞍点（双曲抛物面）
zh_hant: 鞍點（雙曲拋物面）
